app/Controllers/Productos.php

  public function index()
  {
    // Instanciar el modelo ProductosModel
    $productosModel = new ProductosModel();

    // Obtener todos los productos desde la base de datos
    $productos = $productosModel->findAll();
---
SELECT *
FROM `productos`

  public function ver($id)
  {
    // Cargar el modelo ProductosModel
    $productosModel = new ProductosModel();

    // Obtener el producto desde la base de datos por su ID
    $producto = $productosModel->find($id);
---
SELECT *
FROM `productos`
WHERE `productos`.`id` = '2'

  public function guardar()
  {
    // Obtener los datos del formulario
    $nombre = $this->request->getPost('nombre');
    $descripcion = $this->request->getPost('descripcion');
    $precio = $this->request->getPost('precio');

    // Validar los datos del formulario
    $rules = [
      'nombre' => 'required',
      'precio' => 'required|numeric',
    ];

    if (!$this->validate($rules)) {
      return redirect()->back()->withInput()->with('validation', $this->validator);
    }

    // Guardar el nuevo producto en la base de datos
    $productosModel = new ProductosModel();
    $productoData = [
      'nombre' => $nombre,
      'descripcion' => $descripcion,
      'precio' => $precio,
    ];
    $productosModel->insert($productoData);
---
INSERT INTO `productos` (`nombre`, `descripcion`, `precio`) VALUES ('prueba', ',,', '123')